#+TITLE: A list of standard work tasks that a manager may need to do
#+FILETAGS: :Work:Manager:
#+STARTIP: overview, hideallblocks

#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2025-06-30 Mon 20:31]
| Headline                                     |    Time |      |
|----------------------------------------------+---------+------|
| *Total time*                                 | *12:20* |      |
|----------------------------------------------+---------+------|
| Weekday focus tasks                          |   11:34 |      |
| \_  Complete [[elisp:(org-agenda t...        |         | 4:02 |
| \_  Complete [[elisp:(org-agenda t...        |         | 2:47 |
| \_  Complete [[elisp:(org-agenda t...        |         | 3:15 |
| \_  Complete [[elisp:(org-agenda t...        |         | 1:30 |
| Weekday work tasks                           |    0:34 |      |
| \_  Complete [[elisp:(org-agenda t...        |         | 0:07 |
| \_  Complete [[elisp:(org-agenda t...        |         | 0:27 |
| Meetings with direct reports                 |    0:06 |      |
| \_  Message staff leads to complete their... |         | 0:06 |
| Tasks                                        |    0:06 |      |
| \_  Run...                                   |         | 0:06 |
#+END:

* Weekday focus tasks                                              :Periodic:


** TODO Complete [[elisp:(org-agenda t "wf")][work focus time tasks]]
   SCHEDULED: <2025-07-07 Mon 06:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-06-30 Mon 08:35]
   :END:
   - State "DONE"       from "TODO"       [2025-06-30 Mon 08:35]
   - State "DONE"       from "TODO"       [2025-06-24 Tue 08:34]
   - State "DONE"       from "TODO"       [2025-06-16 Mon 20:12]
   - State "DONE"       from "TODO"       [2025-06-10 Tue 05:55]
   - State "DONE"       from "TODO"       [2025-06-03 Tue 08:41]
   - State "DONE"       from "TODO"       [2025-05-26 Mon 16:31]
   - State "DONE"       from "TODO"       [2025-05-20 Tue 19:21]
   - State "DONE"       from "TODO"       [2025-05-13 Tue 08:34]
   - State "DONE"       from "TODO"       [2025-05-05 Mon 20:24]
   - State "DONE"       from "TODO"       [2025-04-29 Tue 07:57]
   - State "DONE"       from "TODO"       [2025-04-22 Tue 08:35]
   - State "DONE"       from "TODO"       [2025-04-14 Mon 10:59]
   - State "DONE"       from "TODO"       [2025-04-07 Mon 18:23]
   - State "DONE"       from "TODO"       [2025-03-31 Mon 07:28]
   - State "DONE"       from "TODO"       [2025-03-25 Tue 21:18]
   - State "DONE"       from "TODO"       [2025-03-17 Mon 18:34]
   - State "DONE"       from "TODO"       [2025-03-10 Mon 07:14]
   - State "DONE"       from "TODO"       [2025-03-04 Tue 08:00]
   - State "DONE"       from "TODO"       [2025-02-24 Mon 10:49]
   - State "DONE"       from "TODO"       [2025-02-18 Tue 08:14]
   - State "DONE"       from "TODO"       [2025-02-10 Mon 10:25]
   - State "DONE"       from "TODO"       [2025-02-03 Mon 21:07]
   - State "DONE"       from "TODO"       [2025-01-27 Mon 20:59]
   - State "DONE"       from "TODO"       [2025-01-20 Mon 07:37]
   :LOGBOOK:
   CLOCK: [2025-06-30 Mon 06:35]--[2025-06-30 Mon 08:05] =>  1:30
   CLOCK: [2025-03-10 Mon 05:57]--[2025-03-10 Mon 07:14] =>  1:17
   CLOCK: [2025-01-20 Mon 06:15]--[2025-01-20 Mon 07:30] =>  1:15
   :END:


** TODO Complete [[elisp:(org-agenda t "wf")][work focus time tasks]]
   SCHEDULED: <2025-07-01 Tue 08:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-06-25 Wed 09:17]
   :END:
   - State "DONE"       from "TODO"       [2025-06-25 Wed 09:17]
   - State "DONE"       from "TODO"       [2025-06-18 Wed 19:54]
   - State "DONE"       from "TODO"       [2025-06-10 Tue 19:40]
   - State "DONE"       from "TODO"       [2025-06-05 Thu 08:44]
   - State "DONE"       from "TODO"       [2025-05-28 Wed 10:17]
   - State "DONE"       from "TODO"       [2025-05-20 Tue 19:28]
   - State "DONE"       from "TODO"       [2025-05-14 Wed 13:58]
   - State "DONE"       from "TODO"       [2025-05-07 Wed 06:08]
   - State "DONE"       from "TODO"       [2025-04-30 Wed 06:31]
   - State "DONE"       from "TODO"       [2025-04-24 Thu 07:57]
   - State "DONE"       from "TODO"       [2025-04-15 Tue 14:31]
   - State "DONE"       from "TODO"       [2025-04-09 Wed 06:17]
   - State "DONE"       from "TODO"       [2025-04-01 Tue 19:14]
   - State "DONE"       from "TODO"       [2025-03-25 Tue 21:29]
   - State "DONE"       from "TODO"       [2025-03-18 Tue 07:10]
   - State "DONE"       from "TODO"       [2025-03-11 Tue 09:47]
   - State "DONE"       from "TODO"       [2025-03-04 Tue 10:20]
   - State "DONE"       from "TODO"       [2025-02-25 Tue 10:46]
   - State "DONE"       from "TODO"       [2025-02-18 Tue 09:09]
   - State "DONE"       from "TODO"       [2025-02-12 Wed 15:08]
   - State "DONE"       from "TODO"       [2025-02-04 Tue 13:05]
   - State "DONE"       from "TODO"       [2025-01-28 Tue 06:04]
   - State "DONE"       from "TODO"       [2025-01-22 Wed 06:06]
   :LOGBOOK:
   CLOCK: [2025-03-18 Tue 06:10]--[2025-03-18 Tue 07:10] =>  1:00
   CLOCK: [2025-03-11 Tue 08:00]--[2025-03-11 Tue 09:47] =>  1:47
   :END:


** TODO Complete [[elisp:(org-agenda t "wf")][work focus time tasks]]
   SCHEDULED: <2025-07-02 Wed 06:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-06-26 Thu 08:46]
   :END:
   - State "DONE"       from "TODO"       [2025-06-26 Thu 08:46]
   - State "DONE"       from "TODO"       [2025-06-20 Fri 09:45]
   - State "DONE"       from "TODO"       [2025-06-12 Thu 07:06]
   - State "DONE"       from "TODO"       [2025-06-05 Thu 08:44]
   - State "DONE"       from "TODO"       [2025-05-31 Sat 09:14]
   - State "DONE"       from "TODO"       [2025-05-23 Fri 15:09]
   - State "DONE"       from "TODO"       [2025-05-15 Thu 06:49]
   - State "DONE"       from "TODO"       [2025-05-07 Wed 18:09]
   - State "DONE"       from "TODO"       [2025-05-01 Thu 08:29]
   - State "DONE"       from "TODO"       [2025-04-17 Thu 06:50]
   - State "DONE"       from "TODO"       [2025-04-17 Thu 06:50]
   - State "DONE"       from "TODO"       [2025-04-10 Thu 09:38]
   - State "DONE"       from "TODO"       [2025-04-02 Wed 09:55]
   - State "DONE"       from "TODO"       [2025-03-26 Wed 17:46]
   - State "DONE"       from "TODO"       [2025-03-19 Wed 09:56]
   - State "DONE"       from "TODO"       [2025-03-12 Wed 07:16]
   - State "DONE"       from "TODO"       [2025-03-06 Thu 10:14]
   - State "DONE"       from "TODO"       [2025-02-26 Wed 16:01]
   - State "DONE"       from "TODO"       [2025-02-21 Fri 06:28]
   - State "DONE"       from "TODO"       [2025-02-12 Wed 15:08]
   - State "DONE"       from "TODO"       [2025-02-05 Wed 07:21]
   - State "DONE"       from "TODO"       [2025-01-30 Thu 08:14]
   - State "DONE"       from "TODO"       [2025-01-22 Wed 07:38]
   :LOGBOOK:
   CLOCK: [2025-03-19 Wed 07:56]--[2025-03-19 Wed 08:56] =>  1:00
   CLOCK: [2025-03-12 Wed 06:00]--[2025-03-12 Wed 07:16] =>  1:16
   CLOCK: [2025-02-05 Wed 06:22]--[2025-02-05 Wed 07:21] =>  0:59
   :END:



** TODO Complete [[elisp:(org-agenda t "wf")][work focus time tasks]]
   SCHEDULED: <2025-07-03 Thu 08:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-06-26 Thu 18:57]
   :END:
   - State "DONE"       from "TODO"       [2025-06-26 Thu 18:57]
   - State "DONE"       from "TODO"       [2025-06-20 Fri 09:45]
   - State "DONE"       from "TODO"       [2025-06-13 Fri 09:48]
   - State "DONE"       from "TODO"       [2025-06-06 Fri 08:43]
   - State "DONE"       from "TODO"       [2025-05-31 Sat 09:14]
   - State "DONE"       from "TODO"       [2025-05-23 Fri 15:09]
   - State "DONE"       from "TODO"       [2025-05-15 Thu 20:33]
   - State "DONE"       from "TODO"       [2025-05-09 Fri 13:28]
   - State "DONE"       from "TODO"       [2025-05-02 Fri 14:17]
   - State "DONE"       from "TODO"       [2025-04-25 Fri 05:22]
   - State "DONE"       from "TODO"       [2025-04-17 Thu 16:32]
   - State "DONE"       from "TODO"       [2025-04-12 Sat 07:23]
   - State "DONE"       from "TODO"       [2025-04-03 Thu 17:00]
   - State "DONE"       from "TODO"       [2025-03-27 Thu 13:14]
   - State "DONE"       from "TODO"       [2025-03-21 Fri 16:04]
   - State "DONE"       from "TODO"       [2025-03-13 Thu 09:18]
   - State "DONE"       from "TODO"       [2025-03-08 Sat 06:54]
   - State "DONE"       from "TODO"       [2025-03-02 Sun 10:14]
   - State "DONE"       from "TODO"       [2025-02-21 Fri 06:28]
   - State "DONE"       from "TODO"       [2025-02-14 Fri 15:34]
   - State "DONE"       from "TODO"       [2025-02-06 Thu 18:59]
   - State "DONE"       from "TODO"       [2025-01-31 Fri 08:30]
   - State "DONE"       from "TODO"       [2025-01-23 Thu 09:54]
   :LOGBOOK:
   :END:


** TODO Complete [[elisp:(org-agenda t "wf")][work focus time tasks]]
   SCHEDULED: <2025-07-04 Fri 06:00 +7d>
   :PROPERTIES:
   :EFFORT: 01:00
   :BENEFIT: 200
   :RATIO: 2.00
   :LAST_REPEAT: [2025-06-27 Fri 18:17]
   :END:
   - State "DONE"       from "TODO"       [2025-06-27 Fri 18:17]
   - State "DONE"       from "TODO"       [2025-06-23 Mon 06:56]
   - State "DONE"       from "TODO"       [2025-06-13 Fri 19:49]
   - State "DONE"       from "TODO"       [2025-06-06 Fri 18:08]
   - State "DONE"       from "TODO"       [2025-05-31 Sat 09:14]
   - State "DONE"       from "TODO"       [2025-05-26 Mon 16:31]
   - State "DONE"       from "TODO"       [2025-05-17 Sat 15:50]
   - State "DONE"       from "TODO"       [2025-05-10 Sat 07:14]
   - State "DONE"       from "TODO"       [2025-05-03 Sat 16:30]
   - State "DONE"       from "TODO"       [2025-04-25 Fri 17:38]
   - State "DONE"       from "TODO"       [2025-04-18 Fri 15:56]
   - State "DONE"       from "TODO"       [2025-04-12 Sat 07:23]
   - State "DONE"       from "TODO"       [2025-04-04 Fri 19:59]
   - State "DONE"       from "TODO"       [2025-03-28 Fri 08:10]
   - State "DONE"       from "TODO"       [2025-03-21 Fri 16:05]
   - State "DONE"       from "TODO"       [2025-03-15 Sat 06:35]
   - State "DONE"       from "TODO"       [2025-03-08 Sat 06:54]
   - State "DONE"       from "TODO"       [2025-03-02 Sun 10:14]
   - State "DONE"       from "TODO"       [2025-02-21 Fri 06:28]
   - State "DONE"       from "TODO"       [2025-02-14 Fri 15:34]
   - State "DONE"       from "TODO"       [2025-02-08 Sat 11:08]
   - State "DONE"       from "TODO"       [2025-02-01 Sat 06:33]
   - State "DONE"       from "TODO"       [2025-01-24 Fri 17:19]
   :LOGBOOK:
   CLOCK: [2025-03-28 Fri 06:40]--[2025-03-28 Fri 08:10] =>  1:30
   :END:


** TODO Review [[elisp:(org-agenda t "wb")][work backlog]]
SCHEDULED: <2025-05-09 Fri +7d>
:PROPERTIES:
:EFFORT:  00:15
:BENEFIT: 10
:RATIO: 0.40
:END:



* Weekday work tasks                                               :Periodic:
:PROPERTIES:
:COLUMNS: %40ITEM %RATIO %LAST_REPEAT %SCHEDULED %DEADLINE
:END:


** TODO Complete [[elisp:(org-agenda t "ws")][weekday work tasks]]
   SCHEDULED: <2025-06-30 Mon 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-06-24 Tue 08:34]
   :END:
   - State "DONE"       from "TODO"       [2025-06-24 Tue 08:34]
   - State "DONE"       from "TODO"       [2025-06-16 Mon 20:25]
   - State "DONE"       from "TODO"       [2025-06-10 Tue 05:55]
   - State "DONE"       from "TODO"       [2025-06-03 Tue 08:41]
   - State "DONE"       from "TODO"       [2025-05-26 Mon 16:31]
   - State "DONE"       from "TODO"       [2025-05-20 Tue 19:21]
   - State "DONE"       from "TODO"       [2025-05-13 Tue 08:34]
   - State "DONE"       from "TODO"       [2025-05-05 Mon 20:24]
   - State "DONE"       from "TODO"       [2025-04-29 Tue 07:57]
   - State "DONE"       from "TODO"       [2025-04-22 Tue 08:35]
   - State "DONE"       from "TODO"       [2025-04-15 Tue 08:34]
   - State "DONE"       from "TODO"       [2025-04-07 Mon 18:23]
   - State "DONE"       from "TODO"       [2025-04-01 Tue 08:20]
   - State "DONE"       from "TODO"       [2025-03-25 Tue 21:18]
   - State "DONE"       from "TODO"       [2025-03-17 Mon 18:34]
   - State "DONE"       from "TODO"       [2025-03-11 Tue 09:47]
   - State "DONE"       from "TODO"       [2025-03-04 Tue 08:00]
   - State "DONE"       from "TODO"       [2025-02-24 Mon 19:40]
   - State "DONE"       from "TODO"       [2025-02-18 Tue 08:14]
   - State "DONE"       from "TODO"       [2025-02-12 Wed 15:08]
   - State "DONE"       from "TODO"       [2025-02-03 Mon 21:07]
   - State "DONE"       from "TODO"       [2025-01-27 Mon 20:59]
   - State "DONE"       from "TODO"       [2025-01-20 Mon 16:28]
   - State "DONE"       from "TODO"       [2025-01-20 Mon 15:43]
   - State "DONE"       from "TODO"       [2025-01-13 Mon 10:12]


** TODO Complete [[elisp:(org-agenda t "ws")][weekday work tasks]]
   SCHEDULED: <2025-07-01 Tue 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-06-25 Wed 09:17]
   :END:
   - State "DONE"       from "TODO"       [2025-06-25 Wed 09:17]
   - State "DONE"       from "TODO"       [2025-06-18 Wed 19:54]
   - State "DONE"       from "TODO"       [2025-06-10 Tue 19:46]
   - State "DONE"       from "TODO"       [2025-06-05 Thu 08:44]
   - State "DONE"       from "TODO"       [2025-05-28 Wed 10:17]
   - State "DONE"       from "TODO"       [2025-05-20 Tue 19:29]
   - State "DONE"       from "TODO"       [2025-05-14 Wed 13:58]
   - State "DONE"       from "TODO"       [2025-05-07 Wed 06:08]
   - State "DONE"       from "TODO"       [2025-04-30 Wed 06:31]
   - State "DONE"       from "TODO"       [2025-04-24 Thu 07:57]
   - State "DONE"       from "TODO"       [2025-04-16 Wed 08:09]
   - State "DONE"       from "TODO"       [2025-04-09 Wed 06:17]
   - State "DONE"       from "TODO"       [2025-04-02 Wed 09:54]
   - State "DONE"       from "TODO"       [2025-03-25 Tue 21:29]
   - State "DONE"       from "TODO"       [2025-03-18 Tue 19:03]
   - State "DONE"       from "TODO"       [2025-03-11 Tue 14:25]
   - State "DONE"       from "TODO"       [2025-03-04 Tue 18:00]
   - State "DONE"       from "TODO"       [2025-02-26 Wed 05:39]
   - State "DONE"       from "TODO"       [2025-02-19 Wed 07:26]
   - State "DONE"       from "TODO"       [2025-02-12 Wed 15:08]
   - State "DONE"       from "TODO"       [2025-02-05 Wed 06:13]
   - State "DONE"       from "TODO"       [2025-01-28 Tue 06:04]
   - State "DONE"       from "TODO"       [2025-01-21 Tue 10:26]
   - State "DONE"       from "TODO"       [2025-01-15 Wed 09:16]
   :LOGBOOK:
   CLOCK: [2025-01-14 Tue 14:53]--[2025-01-14 Tue 15:00] =>  0:07
   :END:


** TODO Complete [[elisp:(org-agenda t "ws")][weekday work tasks]]
   SCHEDULED: <2025-07-02 Wed 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-06-26 Thu 08:46]
   :END:
   - State "DONE"       from "TODO"       [2025-06-26 Thu 08:46]
   - State "DONE"       from "TODO"       [2025-06-20 Fri 09:45]
   - State "DONE"       from "TODO"       [2025-06-12 Thu 07:06]
   - State "DONE"       from "TODO"       [2025-06-05 Thu 08:44]
   - State "DONE"       from "TODO"       [2025-05-31 Sat 09:14]
   - State "DONE"       from "TODO"       [2025-05-23 Fri 15:09]
   - State "DONE"       from "TODO"       [2025-05-15 Thu 06:49]
   - State "DONE"       from "TODO"       [2025-05-07 Wed 18:09]
   - State "DONE"       from "TODO"       [2025-05-01 Thu 08:29]
   - State "DONE"       from "TODO"       [2025-04-24 Thu 07:57]
   - State "DONE"       from "TODO"       [2025-04-17 Thu 06:50]
   - State "DONE"       from "TODO"       [2025-04-10 Thu 09:38]
   - State "DONE"       from "TODO"       [2025-04-03 Thu 05:28]
   - State "DONE"       from "TODO"       [2025-03-26 Wed 17:46]
   - State "DONE"       from "TODO"       [2025-03-21 Fri 16:04]
   - State "DONE"       from "TODO"       [2025-03-12 Wed 19:16]
   - State "DONE"       from "TODO"       [2025-03-06 Thu 10:14]
   - State "DONE"       from "TODO"       [2025-02-27 Thu 07:11]
   - State "DONE"       from "TODO"       [2025-02-13 Thu 09:54]
   - State "DONE"       from "TODO"       [2025-02-13 Thu 09:54]
   - State "DONE"       from "TODO"       [2025-02-05 Wed 17:40]
   - State "DONE"       from "TODO"       [2025-01-30 Thu 08:14]
   - State "DONE"       from "TODO"       [2025-01-22 Wed 16:46]
   - State "DONE"       from "TODO"       [2025-01-16 Thu 05:47]
   :LOGBOOK:
   CLOCK: [2025-01-15 Wed 09:22]--[2025-01-15 Wed 09:49] =>  0:27
   :END:


** TODO Complete [[elisp:(org-agenda t "ws")][weekday work tasks]]
   SCHEDULED: <2025-07-03 Thu 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-06-27 Fri 06:32]
   :END:


   - State "DONE"       from "TODO"       [2025-06-27 Fri 06:32]
   - State "DONE"       from "TODO"       [2025-06-20 Fri 09:46]
   - State "DONE"       from "TODO"       [2025-06-13 Fri 09:48]
   - State "DONE"       from "TODO"       [2025-06-06 Fri 08:43]
   - State "DONE"       from "TODO"       [2025-05-31 Sat 09:14]
   - State "DONE"       from "TODO"       [2025-05-23 Fri 15:09]
   - State "DONE"       from "TODO"       [2025-05-15 Thu 20:33]
   - State "DONE"       from "TODO"       [2025-05-09 Fri 13:28]
   - State "DONE"       from "TODO"       [2025-05-02 Fri 14:17]
   - State "DONE"       from "TODO"       [2025-04-25 Fri 05:22]
   - State "DONE"       from "TODO"       [2025-04-17 Thu 16:32]
   - State "DONE"       from "TODO"       [2025-04-12 Sat 07:23]
   - State "DONE"       from "TODO"       [2025-04-04 Fri 19:58]
   - State "DONE"       from "TODO"       [2025-03-28 Fri 06:11]
   - State "DONE"       from "TODO"       [2025-03-21 Fri 16:05]
   - State "DONE"       from "TODO"       [2025-03-13 Thu 09:18]
   - State "DONE"       from "TODO"       [2025-03-08 Sat 06:54]
   - State "DONE"       from "TODO"       [2025-03-02 Sun 10:14]
   - State "DONE"       from "TODO"       [2025-02-21 Fri 06:28]
   - State "DONE"       from "TODO"       [2025-02-14 Fri 15:35]
   - State "DONE"       from "TODO"       [2025-02-06 Thu 18:59]
   - State "DONE"       from "TODO"       [2025-01-31 Fri 08:30]
   - State "DONE"       from "TODO"       [2025-01-24 Fri 09:41]
   - State "DONE"       from "TODO"       [2025-01-16 Thu 16:26]


** TODO Complete [[elisp:(org-agenda t "ws")][weekday work tasks]]
   SCHEDULED: <2025-07-04 Fri 09:00 +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-06-27 Fri 18:17]
   :END:


   - State "DONE"       from "TODO"       [2025-06-27 Fri 18:17]
   - State "DONE"       from "TODO"       [2025-06-23 Mon 06:56]
   - State "DONE"       from "TODO"       [2025-06-13 Fri 19:49]
   - State "DONE"       from "TODO"       [2025-06-06 Fri 18:08]
   - State "DONE"       from "TODO"       [2025-05-31 Sat 09:14]
   - State "DONE"       from "TODO"       [2025-05-26 Mon 16:31]
   - State "DONE"       from "TODO"       [2025-05-17 Sat 15:50]
   - State "DONE"       from "TODO"       [2025-05-10 Sat 07:14]
   - State "DONE"       from "TODO"       [2025-05-03 Sat 16:30]
   - State "DONE"       from "TODO"       [2025-04-25 Fri 17:38]
   - State "DONE"       from "TODO"       [2025-04-18 Fri 15:57]
   - State "DONE"       from "TODO"       [2025-04-12 Sat 07:23]
   - State "DONE"       from "TODO"       [2025-04-04 Fri 20:01]
   - State "DONE"       from "TODO"       [2025-03-29 Sat 06:51]
   - State "DONE"       from "TODO"       [2025-03-21 Fri 16:05]
   - State "DONE"       from "TODO"       [2025-03-15 Sat 06:35]
   - State "DONE"       from "TODO"       [2025-03-08 Sat 06:54]
   - State "DONE"       from "TODO"       [2025-03-02 Sun 10:14]
   - State "DONE"       from "TODO"       [2025-02-21 Fri 06:28]
   - State "DONE"       from "TODO"       [2025-02-14 Fri 15:34]
   - State "DONE"       from "TODO"       [2025-02-08 Sat 11:08]
   - State "DONE"       from "TODO"       [2025-02-01 Sat 06:33]
   - State "DONE"       from "TODO"       [2025-01-24 Fri 17:19]
   - State "DONE"       from "TODO"       [2025-01-18 Sat 06:48]


* Questions for performance improvement
  :PROPERTIES:
  :CUSTOM_ID: questions_improvement
  :END:

  - Overall, how did we do?
  - Describe one activity that we did well
  - Describe one activity that we can stop doing, start doing or do better


* Organization


** TODO Add quarterly org review to staff meeting agenda           :Meetings:
   SCHEDULED: <2025-07-28 Mon +12w>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-05-05 Mon 20:11]
   :END:


   - State "DONE"       from "TODO"       [2025-05-05 Mon 20:11]
** TODO Review team succession and promotion candidates list       :Meetings:
   SCHEDULED: <2025-07-28 Mon +12w>
   :PROPERTIES:
   :EFFORT:  00:15
   :BENEFIT:  10
   :RATIO:    0.40
   :LAST_REPEAT: [2025-05-05 Mon 20:15]
   :END:

   - State "DONE"       from "TODO"       [2025-05-05 Mon 20:15]
    - See manager tools recommendations on ready now/ready later


* Meetings with direct reports


** TODO Ask direct reports: "Overall, how are you doing?" and "Overall, how is your team doing?" :Meetings:
   SCHEDULED: <2025-07-11 Fri +12w>
   :PROPERTIES:
   :EFFORT:  00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-04-28 Mon 06:50]
   :END:


   - State "DONE"       from "TODO"       [2025-04-28 Mon 06:50]
   - State "DONE"       from "TODO"       [2024-11-10 Sun 16:58]
   - State "DONE"       from "TODO"       [2024-08-12 Mon 09:49]
   - State "DONE"       from "TODO"       [2024-05-20 Mon 13:01]
   - State "DONE"       from "TODO"       [2024-03-03 Sun 17:56]
   - State "DONE"       from "TODO"       [2023-11-20 Mon 08:50]
   - State "DONE"       from "TODO"       [2023-08-28 Mon 06:43]
   - State "DONE"       from "TODO"       [2023-06-05 Mon 13:09]
   - State "DONE"       from "TODO"       [2023-04-03 Mon 10:06]


** TODO Message staff leads to complete their [[https://evconnect.atlassian.net/wiki/spaces/EV/pages/3991273478/Technology+Leadership+Team+Weekly+Staff+Meetings#Action-items][staff meeting]] action items :Messages:
   SCHEDULED: <2025-07-07 Mon +7d>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-06-30 Mon 07:59]
   :END:
   - State "DONE"       from "TODO"       [2025-06-30 Mon 07:59]
   - State "DONE"       from "TODO"       [2025-06-24 Tue 08:36]
   - State "DONE"       from "TODO"       [2025-06-16 Mon 12:48]
   - State "DONE"       from "TODO"       [2025-06-09 Mon 09:30]
   - State "DONE"       from "TODO"       [2025-06-03 Tue 09:51]
   - State "DONE"       from "TODO"       [2025-06-03 Tue 09:49]
   - State "DONE"       from "TODO"       [2025-05-20 Tue 19:22]
   - State "DONE"       from "TODO"       [2025-05-12 Mon 06:38]
   - State "DONE"       from "TODO"       [2025-05-07 Wed 17:32]
   - State "DONE"       from "TODO"       [2025-04-28 Mon 10:50]
   - State "DONE"       from "TODO"       [2025-04-21 Mon 17:00]
   - State "DONE"       from "TODO"       [2025-04-14 Mon 11:56]
   - State "DONE"       from "TODO"       [2025-04-07 Mon 10:05]
   - State "DONE"       from "TODO"       [2025-03-31 Mon 10:43]
   - State "DONE"       from "TODO"       [2025-03-24 Mon 10:28]
   - State "DONE"       from "TODO"       [2025-03-17 Mon 10:16]
   - State "DONE"       from "TODO"       [2025-03-11 Tue 14:21]
   - State "DONE"       from "TODO"       [2025-03-02 Sun 20:23]
   - State "DONE"       from "TODO"       [2025-02-24 Mon 10:59]
   - State "DONE"       from "TODO"       [2025-02-17 Mon 17:12]
   - State "DONE"       from "TODO"       [2025-02-10 Mon 08:11]
   - State "DONE"       from "TODO"       [2025-02-03 Mon 08:18]
   - State "DONE"       from "TODO"       [2025-01-26 Sun 08:59]
   - State "DONE"       from "TODO"       [2025-01-21 Tue 08:31]
   :LOGBOOK:
   CLOCK: [2025-01-21 Tue 08:25]--[2025-01-21 Tue 08:31] =>  0:06
   :END:
   - State "DONE"       from "TODO"       [2025-01-05 Sun 20:34]
   - State "DONE"       from "TODO"       [2024-12-29 Sun 08:45]
   - State "DONE"       from "TODO"       [2024-12-23 Mon 06:36]
   - State "DONE"       from "TODO"       [2024-12-16 Mon 09:00]
   - State "DONE"       from "TODO"       [2024-12-08 Sun 20:04]
   - State "DONE"       from "TODO"       [2024-12-01 Sun 21:04]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-24 Sun 20:44]
   :END:
   - State "DONE"       from "TODO"       [2024-11-24 Sun 20:44]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-18 Mon 10:19]
   :END:
   - State "DONE"       from "TODO"       [2024-11-18 Mon 10:19]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-10 Sun 16:34]
   :END:
   - State "DONE"       from "TODO"       [2024-11-10 Sun 16:34]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-04 Mon 09:57]
   :END:
   - State "DONE"       from "TODO"       [2024-11-04 Mon 09:57]
   :PROPERTIES:
   :LAST_REPEAT: [2024-10-27 Sun 20:15]
   :END:
   - State "DONE"       from "TODO"       [2024-10-27 Sun 20:15]
   :PROPERTIES:
   :LAST_REPEAT: [2024-10-20 Sun 15:49]
   :END:
   - State "DONE"       from "TODO"       [2024-10-20 Sun 15:49]
   - State "DONE"       from "TODO"       [2024-10-14 Mon 11:52]
   :PROPERTIES:
   :END:


** TODO Update [[https://evconnect.atlassian.net/wiki/spaces/te/folder/4292083736?atlOrigin=eyJpIjoiNTVhYjY3YWQzNDA3NDJmYzkwYzA2YTZkMjBkYWQ3ODAiLCJwIjoiYyJ9][staff meeting]] agenda :Browser:
   SCHEDULED: <2025-07-06 Sun +7d>
   :PROPERTIES:
   :LAST_REPEAT: [2025-06-30 Mon 11:56]
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:
   - State "DONE"       from "TODO"       [2025-06-30 Mon 11:56]
   - State "DONE"       from "TODO"       [2025-06-24 Tue 08:36]
   - State "DONE"       from "TODO"       [2025-06-16 Mon 12:48]
   - State "DONE"       from "TODO"       [2025-06-09 Mon 09:29]
   - State "DONE"       from "TODO"       [2025-06-04 Wed 08:06]
   - State "DONE"       from "TODO"       [2025-06-03 Tue 09:49]
   - State "DONE"       from "TODO"       [2025-05-20 Tue 19:22]
   - State "DONE"       from "TODO"       [2025-05-12 Mon 06:25]
   - State "DONE"       from "TODO"       [2025-05-05 Mon 20:10]
   - State "DONE"       from "TODO"       [2025-04-28 Mon 10:40]
   - State "DONE"       from "TODO"       [2025-04-22 Tue 09:27]
   - State "DONE"       from "TODO"       [2025-04-14 Mon 11:56]
   - State "DONE"       from "TODO"       [2025-04-07 Mon 10:06]
   - State "DONE"       from "TODO"       [2025-03-31 Mon 10:58]
   - State "DONE"       from "TODO"       [2025-03-24 Mon 10:06]
   - State "DONE"       from "TODO"       [2025-03-17 Mon 10:16]
   - State "DONE"       from "TODO"       [2025-03-10 Mon 10:04]
   - State "DONE"       from "TODO"       [2025-03-04 Tue 10:22]
   - State "DONE"       from "TODO"       [2025-02-23 Sun 17:55]
   - State "DONE"       from "TODO"       [2025-02-17 Mon 11:09]
   - State "DONE"       from "TODO"       [2025-02-16 Sun 12:11]
   - State "DONE"       from "TODO"       [2025-02-02 Sun 19:38]
   - State "DONE"       from "TODO"       [2025-01-26 Sun 09:12]
   - State "DONE"       from "TODO"       [2025-01-21 Tue 08:33]
   - State "DONE"       from "TODO"       [2025-01-05 Sun 20:48]
   - State "DONE"       from "TODO"       [2024-12-29 Sun 08:45]
   - State "DONE"       from "TODO"       [2024-12-23 Mon 06:36]



* Skip level meetings                                              :Meetings:

I hold skip-level meetings with a sub-group of my skip-levels 2 months
in a quarter. The third month is a town hall meeting.

** Task list for skip level meetings

#+NAME: skip_level_tasks
|--------------------------------------------------------+----|
| Setup post-meeting survey link for skip-level          | -7 |
| Prepare Confluence page for information for skip-level | -5 |
| Answer questions left-over from skip-level             | +1 |
| Setup tasks for next skip level                        | +7 |
|--------------------------------------------------------+----|

#+CALL: ../task_management/Tasks.org:generate_tasks_from_offset(tab=skip_level_tasks, start_date="2025-08-20")

#+RESULTS:
:results:
*** TODO Setup post-meeting survey link for skip-level
    SCHEDULED: <2025-08-13 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Prepare Confluence page for information for skip-level
    SCHEDULED: <2025-08-15 Fri>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Answer questions left-over from skip-level
    SCHEDULED: <2025-08-21 Thu>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Setup tasks for next skip level
    SCHEDULED: <2025-08-27 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


:end:


* Town hall meetings                                               :Meetings:


  Town hall meetings are a good way to broadcast information, discuss
  financial results, have detailed Q&A etc. I conduct town halls once
  every quarter.


** Task list for town hall meetings

#+NAME: town_hall_tasks
|----------------------------------------------------------------------+-----|
| Ask someone to give spotlight presentation in town hall              | -21 |
| Setup site for questions to be submitted in town hall                | -14 |
| Setup post-meeting survey link                                       | -14 |
| Get updates on financial information for town hall                   |  -7 |
| Prepare Confluence page for information for town hall                |  -5 |
| Setup quiz for town hall                                             |  -3 |
| Answer questions left-over from town hall                            |  +1 |
| Give recognition/swag for good questions and organizers in town hall |  +7 |
| Release post-meeting survey results from town hall                   |  +7 |
| Setup tasks for next town hall                                       | +14 |
|----------------------------------------------------------------------+-----|

#+CALL: ../task_management/Tasks.org:generate_tasks_from_offset(tab=town_hall_tasks, start_date="2025-07-09")

#+RESULTS:
:results:
*** DONE Ask someone to give spotlight presentations in town hall
    SCHEDULED: <2025-06-18 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** DONE Setup site for questions to be submitted in town hall
    SCHEDULED: <2025-06-25 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** DONE Setup post-meeting survey link
    SCHEDULED: <2025-06-25 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Get updates on financial information for town hall
    SCHEDULED: <2025-07-02 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Prepare Confluence page for information for town hall
    SCHEDULED: <2025-07-04 Fri>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** DONE Setup quiz for town hall
    SCHEDULED: <2025-07-06 Sun>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Answer questions left-over from town hall
    SCHEDULED: <2025-07-10 Thu>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** DONE Give recognition/swag for good questions and organizers in town hall
    SCHEDULED: <2025-07-16 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Release post-meeting survey results from town hall
    SCHEDULED: <2025-07-16 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** TODO Setup tasks for next town hall
    SCHEDULED: <2025-07-23 Wed>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


:end:
:results:




* Quarterly staff workshops                                        :Meetings:


** Task list for staff workshops

#+NAME: staff_workshop_tasks
|---------------------------------------------------------+-----|
| Request topics for staff workshop                       | -21 |
| Setup Confluence page for staff workshop                | -21 |
| Setup post-meeting survey link for staff workshop       | -14 |
| Release post-meeting survey results from staff workshop |  +3 |
| Setup tasks for next staff workshop meeting date        |  +7 |
|---------------------------------------------------------+-----|

#+CALL: ../task_management/Tasks.org:generate_tasks_from_offset(tab=staff_workshop_tasks, start_date="2025-04-23")

#+RESULTS:
:results:


*** DONE Release post-meeting survey results from staff workshop
    SCHEDULED: <2025-04-26 Sat>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


*** DONE Setup tasks for next staff workshop meeting date
    SCHEDULED: <2025-05-19 Mon>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


:end:


* Tasks


** TODO Run [[id:bb62fc36-9d1f-4426-8f23-bc2494720adf][Code to generate next 1-1]] :Meetings:
SCHEDULED: <2025-06-30 Mon +7d>
:PROPERTIES:
:EFFORT:  00:15
:BENEFIT: 10
:RATIO: 0.40
:LAST_REPEAT: [2025-06-24 Tue 08:36]
:END:
- State "DONE"       from "TODO"       [2025-06-24 Tue 08:36]
- State "DONE"       from "TODO"       [2025-06-16 Mon 20:12]
- State "DONE"       from "TODO"       [2025-06-09 Mon 09:30]
- State "DONE"       from "TODO"       [2025-06-04 Wed 19:57]
- State "DONE"       from "TODO"       [2025-05-26 Mon 16:37]
- State "DONE"       from "TODO"       [2025-05-20 Tue 19:27]
- State "DONE"       from "TODO"       [2025-05-12 Mon 06:16]
- State "DONE"       from "TODO"       [2025-05-07 Wed 17:32]
- State "DONE"       from "TODO"       [2025-05-05 Mon 20:15]
- State "DONE"       from "TODO"       [2025-04-21 Mon 16:34]
- State "DONE"       from "TODO"       [2025-04-14 Mon 11:01]
- State "DONE"       from "TODO"       [2025-04-14 Mon 10:59]
- State "DONE"       from "TODO"       [2025-04-04 Fri 19:59]
- State "DONE"       from "TODO"       [2025-03-27 Thu 07:17]
- State "DONE"       from "TODO"       [2025-03-24 Mon 09:44]
- State "DONE"       from "TODO"       [2025-03-11 Tue 14:20]
- State "DONE"       from "TODO"       [2025-03-04 Tue 10:23]
- State "DONE"       from "TODO"       [2025-02-24 Mon 11:24]
- State "DONE"       from "TODO"       [2025-02-17 Mon 11:08]
- State "DONE"       from "TODO"       [2025-02-16 Sun 12:00]
- State "DONE"       from "TODO"       [2025-02-07 Fri 07:28]
:LOGBOOK:
CLOCK: [2025-01-21 Tue 08:56]--[2025-01-21 Tue 09:02] =>  0:06
:END:
- State "DONE"       from "TODO"       [2025-01-05 Sun 21:06]
- State "DONE"       from "TODO"       [2024-12-29 Sun 13:59]



** DONE Add suggestions for [[https://evconnect.atlassian.net/wiki/spaces/~7120202beca55290554b91891c8138a95946e4/pages/4223008882/Weekly+Leadership+Meeting][Bassem weekly staff meeting]]            :Meetings:
   SCHEDULED: <2025-06-02 Mon>
   :PROPERTIES:
   :EFFORT:  00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-05-26 Mon 16:37]
   :END:
   - State "DONE"       from "TODO"       [2025-05-26 Mon 16:37]
   - State "DONE"       from "TODO"       [2025-05-20 Tue 19:27]
   - State "DONE"       from "TODO"       [2025-05-12 Mon 06:38]
   - State "DONE"       from "TODO"       [2025-05-05 Mon 20:11]
   - State "DONE"       from "TODO"       [2025-04-28 Mon 06:49]
   - State "DONE"       from "TODO"       [2025-04-21 Mon 16:30]
   - State "DONE"       from "TODO"       [2025-04-14 Mon 10:59]
   - State "DONE"       from "TODO"       [2025-04-07 Mon 10:05]
   - State "DONE"       from "TODO"       [2025-03-31 Mon 11:49]
   - State "DONE"       from "TODO"       [2025-03-24 Mon 09:45]
   - State "DONE"       from "TODO"       [2025-03-19 Wed 09:59]
   - State "DONE"       from "TODO"       [2025-03-10 Mon 11:33]
   - State "DONE"       from "TODO"       [2025-03-04 Tue 10:22]
   - State "DONE"       from "TODO"       [2025-02-23 Sun 18:06]
   - State "DONE"       from "TODO"       [2025-02-17 Mon 11:09]
   - State "DONE"       from "TODO"       [2025-02-16 Sun 12:11]
   - State "DONE"       from "TODO"       [2025-02-05 Wed 06:20]
   - State "DONE"       from "TODO"       [2025-01-26 Sun 09:22]
   - State "DONE"       from "TODO"       [2025-01-21 Tue 08:33]
   - State "DONE"       from "TODO"       [2025-01-05 Sun 20:36]
   - State "DONE"       from "TODO"       [2024-12-29 Sun 08:44]
   - State "DONE"       from "TODO"       [2024-12-23 Mon 11:38]
   - State "DONE"       from "TODO"       [2024-12-16 Mon 08:36]
   - State "DONE"       from "TODO"       [2024-12-08 Sun 20:09]
   - State "DONE"       from "TODO"       [2024-12-01 Sun 20:33]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-24 Sun 20:52]
   :END:
   - State "DONE"       from "TODO"       [2024-11-24 Sun 20:52]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-17 Sun 08:10]
   :END:
   - State "DONE"       from "TODO"       [2024-11-17 Sun 08:10]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-10 Sun 16:59]
   :END:
   - State "DONE"       from "TODO"       [2024-11-10 Sun 16:59]
   :PROPERTIES:
   :LAST_REPEAT: [2024-11-04 Mon 20:33]
   :END:
   - State "DONE"       from "TODO"       [2024-11-04 Mon 20:33]
   :PROPERTIES:
   :LAST_REPEAT: [2024-10-27 Sun 20:30]
   :END:
   - State "DONE"       from "TODO"       [2024-10-27 Sun 20:30]
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2024-10-20 Sun 15:42]
   :END:
   - State "DONE"       from "TODO"       [2024-10-20 Sun 15:42]


** TODO Book conference rooms for my meetings for the next 4 weeks  :Browser:
   SCHEDULED: <2025-07-07 Mon +4w>
   :PROPERTIES:
   :LAST_REPEAT: [2025-06-10 Tue 06:49]
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :END:


   - State "DONE"       from "TODO"       [2025-06-10 Tue 06:49]
   - State "DONE"       from "TODO"       [2025-05-12 Mon 06:38]
   - State "DONE"       from "TODO"       [2025-04-14 Mon 11:58]
   - State "DONE"       from "TODO"       [2025-03-18 Tue 05:58]
   - State "DONE"       from "TODO"       [2025-02-16 Sun 20:49]


** TODO Clean up calendar for the upcoming week through the following Monday :Messages:
   SCHEDULED: <2025-07-04 Fri +1w>
   :PROPERTIES:
   :EFFORT: 00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-06-30 Mon 07:58]
   :END:


   - State "DONE"       from "TODO"       [2025-06-30 Mon 07:58]
   - State "DONE"       from "TODO"       [2025-06-23 Mon 06:57]
   - State "DONE"       from "TODO"       [2025-06-16 Mon 12:48]
   - State "DONE"       from "TODO"       [2025-06-09 Mon 09:29]
   - State "DONE"       from "TODO"       [2025-06-03 Tue 09:49]
   - State "DONE"       from "TODO"       [2025-05-26 Mon 20:45]
   - State "DONE"       from "TODO"       [2025-05-20 Tue 19:27]
   - State "DONE"       from "TODO"       [2025-05-12 Mon 06:16]
   - State "DONE"       from "TODO"       [2025-05-05 Mon 20:10]
   - State "DONE"       from "TODO"       [2025-04-28 Mon 10:28]
   - State "DONE"       from "TODO"       [2025-04-18 Fri 10:43]
   - State "DONE"       from "TODO"       [2025-04-14 Mon 10:59]
   - State "DONE"       from "TODO"       [2025-04-07 Mon 10:01]
   - State "DONE"       from "TODO"       [2025-03-31 Mon 10:43]
   - State "DONE"       from "TODO"       [2025-03-24 Mon 09:45]
   - State "DONE"       from "TODO"       [2025-03-16 Sun 15:38]
   - State "DONE"       from "TODO"       [2025-03-09 Sun 15:36]
   - State "DONE"       from "TODO"       [2025-03-02 Sun 19:41]
   - State "DONE"       from "TODO"       [2025-02-23 Sun 17:44]
- State "DONE"       from "TODO"       [2025-02-16 Sun 12:01]
- State "DONE"       from "TODO"       [2025-02-10 Mon 08:11]
- State "DONE"       from "TODO"       [2025-02-03 Mon 08:16]


** TODO Ask manager for feedback on performance based on [[#questions_improvement][these questions]] every 3 months :Meetings:
   SCHEDULED: <2025-07-11 Fri +12w>
   :PROPERTIES:
   :EFFORT:  00:15
   :BENEFIT: 10
   :RATIO: 0.40
   :LAST_REPEAT: [2025-04-18 Fri 15:57]
   :END:


   - State "DONE"       from "TODO"       [2025-04-18 Fri 15:57]
   - State "DONE"       from "TODO"       [2024-11-28 Thu 09:48]
   - State "DONE"       from "TODO"       [2024-09-04 Wed 16:15]
   - State "DONE"       from "TODO"       [2024-06-14 Fri 07:54]
   - State "DONE"       from "TODO"       [2024-03-24 Sun 20:58]
   - State "DONE"       from "TODO"       [2023-12-30 Sat 08:27]
   - State "DONE"       from "TODO"       [2023-10-05 Thu 16:15]
   - State "DONE"       from "TODO"       [2023-07-12 Wed 13:02]
   - State "DONE"       from "TODO"       [2023-04-05 Wed 18:17]
